{
    "IT":{
        "img": {
            "url" : "assets/home-bg-2.jpg",
            "alt" : "Jr"
        },
        "title":"Sono Junior",
        "subtitle":"Sviluppatore Web specializzato in Angular",
        "italyArriveTitle" : "Arrivo in Italia",
        "italyArriveDesc" : "Sono arrivato in Italia insieme a mio padre durante l'inizio della primavera del 2001, la primissima cosa che ricordo all'uscire dall'aeroporto è il profumo di caffè.\nHo fatto le elementari presso la scuola Console Marcello nella zona sud di Milano e rispetto alla mia scuola in Perù ricordo che mi sembrava di essere in un film per quanto la trovavo bella.\nIn questo periodo ho cominciato a sviluppare una certa bravura per il disegno.\n\nPiccola curiosità: quando ho scoperto che sarei venuto in italia mi ero fatto l'idea che in italia tutto fosse super tecnologico e pensavo di ritrovarmi in un paese pieno di robot! XD\n\nGià più grande, le medie le feci presso l'istituto Cristoforo Colombo ed in quegli anni insieme al miglioramento nel disegno sviluppai molto anche l'immaginazione.",
        "informaticTitle" : "Primi passi verso l'informatica.",
        "informaticDesc" : "Verso la metà dell'ultimo anno delle medie i miei realizzarono il sogno di comprare casa e ci trasferimmo.\nEravamo dall'altra parte della città rispetto a prima e ricordo che mi piaceva moltissimo fare tutta la lunga strada per arrivare a scuola, mi dava una sensazione di indipendenza molto gradevole.\n\nArrivato alle superiori scelsi di studiare il corso di ragioniere-programmatore, infatti vedevo la possibilità di sbocchi lavorativi immediati post-diploma.\nNon saprò mai se sia stata la scelta migliore, molti miei professori delle media infatti ritenevano che all'artistico avrei fatto grandi cose.\nDurante il 3° anno le lezioni di informatica cambiarono, ed incominciarono a trattare la programmazione, le prime settimane furono durissime, ma poi accade quello che io ritengo sia stata la mia ILLUMINAZIONE.",
        "developTitle" : "Come diventai sviluppatore.",
        "developDesc" : "Sono tanti anni che lavoro con il pc e nel corso della mia sperienza ho anche offerto ripetizioni di programmazione a ragazzi e ragazze.\nAlcuni di questi ragazzi per quanti metodi usassi per spiegare loro i ragionamenti da seguire (Flowchart, Scratch, debug, disegnini) non riuscivano ad \"entrare\" nella logica della programmazione.\nEd è così che penso di essermi sentito io un inverno di tanti anni fa.\n\nPiccola curiosità: Ho addirittura cercato di insegnare alla mia ragazza, ma non è per lei la programmazione.\n\nUn venerdì, si tenne quella che era la lezione di programmazione che doveva servire come ripasso per il primo test di programmazione in Visual Basic, test che si doveva tenere il lunedì seguente.\nRicordo che mi sentivo completamente perso, non capivo niente durante le lezioni teoriche e quando eravamo in aula computer era ancora peggio.\n\nIl sabato ero disperato, cercavo di farmi entrare qualcosa in testa ma senza risultati, pensavo che la materie fosse troppo difficile e che la programmazione fosse roba da cervelloni.\nLa domenica, decisi di passarla davanti al pc con l'IDE di Visual Basic aperto.\nAndando a tentoni facevo funzionare qualcosina e speravo di memorizzare qualcosa così da riscriverlo uguale durante il test, non mi rendevo conto che però parallelamente stavo memorizzando la sintassi di Visual Basic.\nDurante la giornata però, in un momento preciso, quasi per magia o per miracolo (fate voi), ebbi quello che definisco effetto Limitless*, prima ero cieco, poi vedevo.\n\nNon sò di preciso cosa sia stato, potreste dire \"hai studiato Junior!\", ma invece io vi assicuro che la sensazione era completamente diversa rispetto a quando capisci una cosa che stavi studiando.\nNon era un effetto del tipo \"aaahh ma è così che funzionaaa! eccoo...\" ma era più un \"Sò come scrivere l'algoritmo per risolvere quel problema e sò dirti il perchè deve essere scritto così\".\nInutile dire che quel compito andò benissimo così come anche tutti gli altri.\n\nQuesto mi spinse a scrivermi alla facoltà di Informatica dell'Università degli Studi di Milano ed in seguito a lavorare nel mondo dello sviluppo web.\nSono riuscito ad unire le due cose che penso fare bene e che mi divertono: programmare e disegnare.\n\n\n* Se non avete visto il film, guardatelo ed andate al minuto 12:21"
    },
    "EN":{
        "img": {
            "url" : "assets/home-bg-2.jpg",
            "alt" : "Jr"
        },
        "title":"Im Junior",
        "subtitle":"Web developer specialized in Angular",
        "italyArriveTitle" : "Arrival in Italy",
        "italyArriveDesc" : "I arrived in Italy with my father during the early spring of 2001, the very first thing I remember upon leaving the airport is the aroma of coffee.\nI went to elementary school at the Console Marcello school in the southern part of Milan, and compared to my school in Peru I remember feeling like I was in a movie because of how beautiful I found it.\nAround this time I began to develop a skills for drawing.\n\nLittle curiosity: when I found out I was coming to italy (5 years old) I had the idea that everything in italy was super technological and I thought I would find myself in a country full of robots! XD\n\nAlready older, I went to middle school at the Cristoforo Colombo Institute and in those years along with the improvement in drawing I also developed my imagination a lot.",
        "informaticTitle" : "First steps toward computing.",
        "informaticDesc" : "Around the middle of my senior year of middle school, my parents realized their dream of buying a house and we moved.\nWe were on the other side of town from before, and I remember really enjoying going all the long way to school, it gave me a very pleasant feeling of independence.\n\nWhen I got to high school I chose to study the accountant-programmer course, in fact I saw the possibility of immediate job outlets post-high school graduation.\nI will never know if it was the best choice, many of my middle school professors in fact believed that I would do great things at Artistic.\nDuring the 3rd year the computer classes changed, and they began to cover programming, the first few weeks were very hard, but then occurs what I believe was my BRAINWAVE.",
        "developTitle" : "How I became a Developer",
        "developDesc" : "I have been working with PC for many years and in the course of my sperience I have also offered programming repetitions to teens.\nSome of these kids no matter how many methods I used to explain to them the reasoning to be followed (Flowchart, Scratch, debugging, sketching) could not \"get into\" the logic of programming.\nAnd that's how I think I felt one winter many years ago.\n\nFun fact: I even tried to teach my girlfriend, but programming is not for her.\n\nOne Friday, we had what was to be a programming class that was to serve as a review for the first programming test in Visual Basic, a test that was to be given the following Monday.\nI remember feeling completely lost, I didn't understand anything during the theory classes and when we were in the computer room it was even worse.\n\nOn Saturday I was desperate, I was trying to get something into my head but to no avail, I thought the subject was too difficult and that programming was brainy stuff.\nOn Sunday, I decided to spend it in front of the PC with the Visual Basic IDE open.\nFumbling around I would get a little something working and hope to memorize something so I could rewrite it the same during the test, not realizing that I was memorizing Visual Basic syntax in parallel, however.\nDuring the day however, at a specific moment, almost by magic or a miracle (you name it), I had what I call the Limitless effect*, first I was blind, then I could see.\n\nI don't know exactly what it was, you might say \"you studied Junior!\" but instead I assure you that the feeling was completely different than when you understand something you were studying.\nIt wasn't an effect of \"oohh but that's how it works! that's it...\" but it was more like \" I know how to write the algorithm to solve that problem and I can tell you why it has to be written that way.\"\nNeedless to say, that test went very well as did all the others.\n\nThis prompted me to apply to the faculty of Computer Science at the University of Milan and later to work in the world of web development.\nI managed to combine the two things I think I do well and enjoy: programming and designing.\n\n* If you haven't seen the movie, watch it and go to minute 12:21"
       
    }
}